#define UNIONS

using System;
using System.Runtime.InteropServices;
using System.IO;
using System.Text;
using Anolis.Core.Data;

namespace Anolis.Core.Native {
	
	// word  = ushort = UInt16
	// dword = uint   = UInt32
	// long  = int    = Int32

#region Bitmaps
	
	namespace Gdi {
		
		/// <remarks>OS/2 DIB Header. bcBitCount can be one of 1, 4, 8, or 24</remarks>
		[StructLayout(LayoutKind.Sequential, Pack=2)]
		internal struct BitmapCoreHeader {
			public UInt32 bcSize;
			public UInt16 bcWidth;
			public UInt16 bcHeight;
			public UInt16 bcPlanes;
			public UInt16 bcBitCount;
			
			public BitmapCoreHeader(BinaryReader rdr) {
				bcSize     = rdr.ReadUInt32();
				bcWidth    = rdr.ReadUInt16();
				bcHeight   = rdr.ReadUInt16();
				bcPlanes   = rdr.ReadUInt16();
				bcBitCount = rdr.ReadUInt16();
			}
		}
		
		/// <remarks>Windows 3.x DIB Header</remarks>
		[StructLayout(LayoutKind.Sequential, Pack=2)]
		internal struct BitmapInfoHeader {
			
			public UInt32 biSize;
			public Int32  biWidth;
			public Int32  biHeight;
			public UInt16 biPlanes;
			public UInt16 biBitCount;
			public BiCompression biCompression;
			public UInt32 biSizeImage;
			public Int32  biXPelsPerMeter;
			public Int32  biYPelsPerMeter;
			public UInt32 biClrUsed;
			public UInt32 biClrImportant;
			
			public BitmapInfoHeader(BinaryReader rdr) {
				biSize          = rdr.ReadUInt32();
				biWidth         = rdr.ReadInt32();

		public ResIconDirectoryEntry(BinaryReader rdr) {
			
			bWidth      = rdr.ReadByte();
			bHeight     = rdr.ReadByte();
			bColorCount = rdr.ReadByte();
			bReserved   = rdr.ReadByte();
			
			wPlanes     = rdr.ReadUInt16(); // also XHotspot
			wBitCount   = rdr.ReadUInt16(); // also YHotspot
			
			dwBytesInRes = rdr.ReadUInt32();
			wId          = rdr.ReadUInt16();
		}
		
		public void Write(BinaryWriter wtr) {
			
			wtr.Write( bWidth );
			wtr.Write( bHeight );
			wtr.Write( bColorCount );
			wtr.Write( bReserved );
			
			wtr.Write( wPlanes );
			wtr.Write( wBitCount );
			
			wtr.Write( dwBytesInRes );
			wtr.Write( wId );
		}
		
	}
	
	/// <summary>Defines the peristent format of an icon directory entry in a .ICO file.</summary>
	[StructLayout(LayoutKind.Explicit)]
	internal struct FileIconDirectoryEntry {
		[FieldOffset( 0)] public byte   bWidth;
		[FieldOffset( 1)] public byte   bHeight;
		[FieldOffset( 2)] public byte   bColorCount; // Number of colors in image (0 if >=8bpp)
		[FieldOffset( 3)] public byte   bReserved;
		
		[FieldOffset( 4)] public ushort wPlanes; // Icon-specific
		[FieldOffset( 6)] public ushort wBitCount;
		[FieldOffset( 4)] public ushort wXHotspot; // Cursor-specific
		[FieldOffset( 6)] public ushort wYHotspot;
		
		[FieldOffset( 8)] public uint   dwBytesInRes;
		[FieldOffset(12)] public uint   dwImageOffset;
		
		public const Int32 Size = 16;
		
		public FileIconDirectoryEntry(BinaryReader rdr) {
			
			wXHotspot = 0;
			wYHotspot = 0;
			
			bWidth        = rdr.ReadByte();
			bHeight       = rdr.ReadByte();
			bColorCount   = rdr.ReadByte();
			bReserved     = rdr.ReadByte();
			
			wPlanes       = rdr.ReadUInt16(); // also XHotspot
			wBitCount     = rdr.ReadUInt16(); // also YHotspot
			
			dwBytesInRes  = rdr.ReadUInt32();
			dwImageOffset = rdr.ReadUInt32();
		}
		
		public void Write(BinaryWriter wtr) {
			
			wtr.Write( bWidth );
			wtr.Write( bHeight );
			wtr.Write( bColorCount );
			wtr.Write( bReserved );
			
			wtr.Write( wPlanes );   // also XHotspot
			wtr.Write( wBitCount ); // also YHotspot
			
			wtr.Write( dwBytesInRes );
			wtr.Write( dwImageOffset );
		}
	}

#endregion
	
#region Version
	
	[StructLayout(LayoutKind.Sequential, Pack=2)]
	internal struct VSVersionInfo {
		public UInt16 wLength;
		public UInt16 wValueLength;
		public UInt16 wType;
		public String szKey;
		public Byte[] Padding1;
		public VSFixedFileInfo Value;
		public Byte[] Padding2;
		public UInt16[] Children;
		
//		public VSVersionInfo(BinaryReader rdr) {
//			wLength      = rdr.ReadUInt16();
//			wValueLength = rdr.ReadUInt16();
//			wType        = rdr.ReadUInt16();
//			szKey        = System.Text.Encoding.Unicode.GetString( rdr.ReadBytes( "VS_VERSION_INFO".Length * 2 ) );
//			
//		}
	}

#if UNIONS
	
	[StructLayout(LayoutKind.Explicit, Pack=2)]
	internal struct VSFixedFileInfo {
		[FieldOffset(0x00)] public UInt32 dwSignature;
		[FieldOffset(0x04)] public UInt32 dwStrucVersion;
		[FieldOffset(0x08)] public UInt32 dwFileVersionMS;
		[FieldOffset(0x0C)] public UInt32 dwFileVersionLS;
		[FieldOffset(0x10)] public UInt32 dwProductVersionMS; 
		[FieldOffset(0x14)] public UInt32 dwProductVersionLS; 
		[FieldOffset(0x18)] public UInt32 dwFileFlagsMask; 
		[FieldOffset(0x1C)] public VSFixedFileFlags dwFileFlags; 
		[FieldOffset(0x20)] public VSFixedFileOS    dwFileOS; 
		[FieldOffset(0x24)] public VSFixedFileType  dwFileType;
		[FieldOffset(0x28)] public UInt32 dwFileSubType;
		[FieldOffset(0x28)] public VSFixedFileSubTypeDriver dwFileSubTypeDriver;
		[FieldOffset(0x28)] public VSFixedFileSubTypeFont   dwFileSubTypeFont;
		[FieldOffset(0x2C)] public UInt32 dwFileDateMS; 
		[FieldOffset(0x30)] public UInt32 dwFileDateLS;
		
		public VSFixedFileInfo(BinaryReader rdr) {
			
			dwFileSubTypeDriver = 0;
			dwFileSubTypeFont   = 0;
			
			dwSignature        = rdr.ReadUInt32();
			dwStrucVersion     = rdr.ReadUInt32();
			dwFileVersionMS    = rdr.ReadUInt32();
			dwFileVersionLS    = rdr.ReadUInt32();
			dwProductVersionMS = rdr.ReadUInt32();
			dwProductVersionLS = rdr.ReadUInt32();
			dwFileFlagsMask    = rdr.ReadUInt32();
			dwFileFlags        = (VSFixedFileFlags)rdr.ReadUInt32();
			dwFileOS           = (VSFixedFileOS)   rdr.ReadUInt32();
			dwFileType         = (VSFixedFileType) rdr.ReadUInt32();
			dwFileSubType      = rdr.ReadUInt32();
			dwFileDateMS       = rdr.ReadUInt32();
			dwFileDateLS       = rdr.ReadUInt32();
		}
		
		public VSFixedFileInfo(Byte[] data) {
			
			if(data.Length < 0x34) throw new ArgumentException("data needs to be at least 0x34 bytes long", "data");
			
			dwFileSubTypeDriver = 0;
