Repository: daiplusplus/anolis
Catalog: Anolis.Installer/Resources/Resx/_backup/*.resx
Languages: da, de, fa

# D_A_toolsLbl
source: The downloadable tools include Resourcer, a powerful resource editor; Packager, which is used to make your actual package files and customized installers; and various other tools including a light icon editor.
da: Den downloaded pakke indeholder Resourcer, en kraftfuld resource editor; Packager, hvilket er brugt til at lave dine pakke filer og egne installatører; og andre værktøjer inklusiv en lille ikon editor.
de: Die herunterladbaren Werkzeuge beinhalten einen Ressourcer, einen mächtigen Ressourcen-Editor, einen Packer, welcher verwendet wird, um Ihre Paket-Dateien und eigenen Installationsroutinen zu erstellen und verschiedene andere Werkzeuge wie z.B. einen einfachen Ikon-Editor.
fa: .ابزار دانلود شده شامل ریسورس ها یک ریسورس ادیتور قدرتمند بسته که استفاده شده در بسته فایلها و سفارشی شده نصب و ابزارهای گوناگون دیگر در بر دارد لایت ایکون ادیتور

# D_B_downloadFailed
source: Download failed
de: Herunterladen fehlgeschlagen
fa: دانلود با شکست مواجه شد

# D_B_status
source: Preparing...
da: Forbereder.
de: Vorbereiten...
fa: ...در حال

# D_B_statusLbl
source: Preparing...
de: Vorbereiten...
fa: ...در حال

# D_B_Subtitle
source: Now downloading the Anolis tools
da: Downloader nu Anolis værktøjerne
de: Die Anolis-Werkzeuge werden jetzt heruntergeladen
fa: در حال دانلود ابزار اناالیس

# D_B_Title
source: Downloading
da: Downloader
de: Herunterladen
fa: در حال دانلود

# E_A_browse
source: Browse...
da: Vælg mappe
de: Durchsuchen
fa: ...جستجو

# E_A_dirLbl
source: Directory
da: Mappe
de: Pfad:
fa: دایرکتوری

# E_A_notValidDirectory
source: The specified directory does not contain a valid uninstallation package
da: Den valgte mappe indeholder ikke en afinstallerings pakke.
de: Der angegebene Pfad enthält kein gültiges Deinstallation-Verzeichnis
fa: دایرکتوری تعیین شده در بر نداردانیستالر معتبر بسته

# E_A_Subtitle
source: Select the directory to recover from
de: Wähle das Verzeichnis, von welchem wiederhergestellt werden soll
fa: انتخاب دایرکتوری برای بازگردانی از

# E_A_sysRes
source: Create System Restore Point (Recommended)
da: Lav et system gendannelses punkt (Anbefalet)
de: Erstelle System-Wiederherstellungs-Punkt (empfohlen)
fa: ایجاد سیستم ریستور پوینت توصه میشود

# E_A_sysResDesc
source: An added layer of protection. Note this does not always protect against modifications made to non-Windows files under Program Files
da: Et ekstra lag af beskytellese. Dette vil dog ikke beskytte imod ændringer lavet til ikke-Windows filer under Programmer.
de: Beachte: diese zusätzliche Sicherung schützt unter Umständen nicht vor Modifikationen an Nicht-Windows-Dateien im Ordner 'Programme'
fa: اضافه کردن یک لایه محافظ.یادداشت این همیشه محافظت نمیکند از تغییرات دوباره ایجاد شده بروی ویندوز فایل در پروگرام فایل

# E_A_Title
source: Select Backup Directory
da: Vælg din backup mappe
de: Sicherungs-Verzeichnis auswählen
fa: انتخاب دایرکتوری نسخه پشتیبان

# E_A_uninstallButton
source: Uninstall
de: Deinstallieren
fa: حذف کامل

# E_B_Subtitle
source: Now uninstalling your package
da: Vælg en mappe at gendanne fra
de: Verzeichnis wählen, von welchem wiederhergestellt werden soll
fa: انتخاب دایرکتوری برای ریکاور از

# E_B_Subtitle_Cus
source: Now uninstalling {0}
de: {0} wird installiert
fa: {0} در حال حذف کامل

# E_B_Title
source: Uninstalling package
de: Paket wird deinstalliert
fa: در حال حذف کامل بسته

# F_aborted
source: Installation aborted
de: Installation abgebrochen
fa: نصب ناتمام ماند

# F_abortedDesc
source: Installation was aborted due to an unhandled exception
de: Installation wurde wegen einer unbehandelten Ausnahme abgebrochen
fa: نصب ناتمام ماند با یک خطای ناشناخته

# F_finishButton
source: Finish
da: Færdig
de: Beenden
fa: پایان

# F_installationComplete
source: Installation has been completed succesfully.
da: Installeringen er udført.
de: Die Installation wurde erfolgreich abgeschlossen.
fa: .نصب با موفقیت انجام شد

# F_installationCompleteRestart
source: Installation has been completed succesfully. Your computer will now restart. Close all open applications before continuing. Do not attempt to open any new applications.
da: Installeringen er udført. Din computer vil nu blive genstartet Luk alle åbne programmer før du forsætter. Prøv ikke at åbne flere programmer
de: Die Installation wurde erfolgreich abgeschlossen. Der Rechner wird neu gestartet. Schließen Sie alle geöffneten Anwendungen bevor Sie fortfahen. Versuchen Sie nicht eine weitere Anwendung zu öffnen.
fa: نصب با دقت انجام شد رایانه شما حالا ریستارت میشود بستن همه پنجره های باز قبل از ادامه سعی نکید برای باز کردن نرم افزار دیگر

# F_installTools
source: Installation has been completed succesfully.
da: Installationen er blevet udført.
de: Die Installation wurde erfolgreich abgeschlossen.
fa: .نصب با موفقیت انجام شد

# F_restartButton
source: Restart
da: Genstart
de: Neustart
fa: ریستارت

# F_title
source: Installation Complete
da: Installering færdig.
de: Installation abgeschlossen
fa: نصب کامل شد

# F_uninstallationComplete
source: Uninstallation has been completed succesfully.
da: Afinstalleringen er udført.
de: Die Deinstallation wurde erfolgreich abgeschlossen.
fa: عملیات حذف با موفقیت انجام شد.رایانه شما حالا ریستارت میشود

# F_uninstallationCompleteRestart
source: Uninstallation has been completed succesfully. Your computer will now restart. Close all open applications before continuing. Do not attempt to open any new applications.
da: Din computer vil nu blive genstartet Luk alle åbne programmer før du forsætter. Prøv ikke at åbne flere programmer
de: Die Deinstallation wurde erfolgreich abgeschlossen. Der Rechner wird neu gestartet. Schließen Sie alle geöffneten Anwendungen bevor Sie fortfahen. Versuchen Sie bitte nicht eine weitere Anwendung zu öffnen.
fa: عملیات حذف با موفقیت انجام شد.رایانه شما حالا ریستارت میشود بستن همه پنجره های باز قبل از ادامه سعی نکید برای باز کردن نرم افزار دیگر.

# G_restarting
source: Now restarting your computer
da: Genstart venligst din computer
de: Der Rechner wird nun neugestartet...
fa: در حال راه اندازی مجدد رایانه

# G_Title
source: Please Wait...
da: Vent venligst
de: Bitte warten...
fa: ...منتظر بمانید

# Lang_Lcid
source: en
da: da
de: de
fa: fa

# Lang_Name
source: English
da: Dansk
de: Deutsch
fa: فارسی

# Wiz_Cancel
source: Cancel
da: Annuler
de: Abbrechen
fa: لغو

# Wiz_CancelConfirm
source: Are you sure you want to cancel installation?
da: Er du sikker på at du vil stoppe installationen?
de: Sind Sie sich sicher, dass Sie die Installation abbrechen wollen?
fa: ایا لغو نصب برنامه را مطمن هستید؟

# Wiz_Defaults
source: Defaults
de: Standard
fa: پیش فرض

# Wiz_Next
source: Next
da: Næste
de: Weiter
fa: بعدی

# Wiz_OK
source: OK
fa: تایید

# Wiz_Prev
source: Back
da: Tilbage
de: Zurück
fa: قبلی

# X_Bootscreen
source: Bootscreen
de: Startbildschirm
fa: صفحه بوت

# X_CursorScheme
source: Mouse Cursors
de: Mauszeiger
fa: مکان نمای ماوس

# X_Screensaver
source: Screensaver
de: Bildschrimschoner
fa: اسکرین سیور

# C_E1_Presets
source: Scheme Presets
de: Entwurf-Voreinstellung
