Repository: daiplusplus/anolis
Catalog: Anolis.Installer/Resources/Resx/_backup/*.resx
Languages: da, de, fa

# A_cultureLbl
source: Installation Language
de: Sprache des Installations-Assistenten
fa: زبان نصب کننده

# A_DeletingTemporaryFiles
source: Deleting temporary files
de: Lösche temporäre Dateien
fa: در حال حذف فایل های موقتی

# A_DisableAV
source: Before continuing, please disable Windows Defender and any anti-virus software as they slow down the installation process.
da: Før du forsætter, slå venligst Windows Defender og andre anti-virus programmer fra da de sløver installations processen.
de: Bitte deaktivieren Sie Windows Defender und andere Anti-Viren-Software bevor Sie fortfahren, da diese den Installationsprozess verlangsamen.
fa: قبل از ادامه دادن لطفا ویندوز دفندر و انتی ویروستان را غیر فعال کنید زیرا ان سرعت نصب را کاهش میدهد

# A_notes
source: This wizard will guide you through the steps involved in installing an Anolis package. To continue, press Next
da: Denne guide vil føre dig igennem trinene involveret i at installere Anolis pakken. For at forsætte, tryk Næste.
de: Dieser Assistent begleitet Sie schrittweise durch die Installation eines Anolis Paketes. Klicken Sie auf 'Weiter', um fortzufahren.
fa: این ویزارد به شما کمک میکند به طور مستقیم و گام به گام برای نصب بسته انولیس برای ادامه بروی بعدی کلیک نمایید

# A_Notes_Cus
source: This wizard will guide you through the steps involved in installing {0} To continue, press Next
da: Denne guide vil føre dig igennem trinene involveret i at installere {0} For at forsætte, tryk Næste.
de: Dieser Assistent begleitet Sie schrittweise durch die Installation von {0}. 'Weiter' drücken, um fortzufahren
fa: {0}این ویزارد به شما کمک میکند به طور مستقیم و گام به گام برای نصب بسته برای ادامه بر روی بعدی کلیک کنید

# A_title
source: Welcome to the Anolis Package Installer
da: Velkommen til Anolis pakke installatøren
de: Willkommen zur Anolis Paket-Installation
fa: خوش امدید به بسته نصب انو الیس

# A_Title_Cus
source: Welcome to the {0} Installer
da: Velkommen til {0}
de: Willkommen zu {0}
fa: به نصب کننده{0}خوش امدید

# B_installBlurb
source: Installs a package located in this Anolis distribution or elsewhere in this computer. The package can be installed to a setup files (I386) folder.
da: Installerer en pakke i denne Anolis distribution eller et andet sted på computeren. Pakken kan blive installeret til en setup fil (I386) mappe.
de: Installiert ein Paket aus dieser Anolis-Distribution oder von externer Stelle. Dieses Paket kann auch in eine Windows-CD eingebunden werden (Windows CD-Image).
fa: این بسته را میتوانید در مکان اصلی یا هر جای دیگر رایانه نصب کنید.این بسته میتواند نصب شود بر روی فایل های نصب سی دی ویندوز

# B_installBlurb_Cus
source: Installs {0} onto this computer or to a setup files (I386) folder.
da: Installerer {0} på denne computer eller en installering (I386)mappe
de: Installiert {0} auf diesem Rechner oder in den Ordner für ein Windows CD-Image.
fa: {0}نصب بر روی رایانه یا سی دی نصب ویندوز

# B_installRad
source: Install a package
da: Installer en pakke
de: Installiere ein Paket
fa: نصب بسته

# B_installRad_Cus
source: Install {0}
da: Installer {0}
de: Installiere {0}
fa: {0}نصب

# B_Subtitle
source: Choose an operation to perform
da: Vælg en opgave at udføre
de: Wähle die Operation, welche ausgeführt werden soll
fa: انتخاب عملیات برای انجام دادن

# B_Title
source: Select a Task
da: Vælg en opgave
de: Wähle eine Aufgabe
fa: انتخاب تاسک

# B_toolsBlurb
source: Downloads tools so you can easily make your own package or distribution
da: Download værktøjer så du nemt kan lave dine egne pakker eller distributioner
de: Lädt Werkzeuge, um damit eigene Pakete oder Distributionen erstellen zu können.
fa: دانلود ابزار بنابراین شما میتواید به اسانی بسته مورد نظر خد را بسازید یا توسعه دهید

# B_toolsBlurb_Cus
source: Downloads tools so you can easily make your own package or distribution just like {0}
da: Download værktøjer så du nemt kan lave dine egne pakker eller distributioner ligesom {0}
de: Lädt Werkzeuge, um damit eigene Pakete oder Distributionen wie {0} erstellen zu können.
fa: {0} دانلود ابزار بنابراین شما میتواید به اسانی بسته مورد نظر خد را بسازید یا توسعه دهید فقط مانند

# B_toolsRad
source: Make my own package or distribution
da: Lav din egen pakke eller distribution
de: Erstelle eigenes Paket/Distribution
fa: ساختن بسته برای خودم یا تعمیم دادن

# B_uninstallBlurb
source: Recovers files to their before-patched status. You will need the backup directory that was created during installation
da: Gendanner filer til deres tideligere status. Du bliver nød at lave en backup af mappen der var lavet under installationen
de: Stellt vorherigen Zustand der Dateien wieder her. Es wird dabei das Sicherungs- Verzeichnis benötigt, welches während der Installation zuvor angelegt wurde.
fa: بازگردانی فایلها به قبل از نصب برنامه.شما نیاز دارید به نسخه پشتیبان از مسیری که در مدت نصب ایجاد شده

# B_uninstallRad
source: Undo changes made by a package installation
da: Tilbagerul ændringer lavet af denne distribution
de: Änderungen einer Paket-Installation rückgängig machen
fa: اندو تغییرات ایجاد شده توسط بسته نصب

# B_uninstallRad_Cus
source: Undo changes made by {0}
da: Tilbagerul ændringer lavet af {0}
de: Änderungen von {0} rückgängig machen
fa: {0}اندو تغییرات ایجاد شده

# C_A_anopBrowse
source: Browse...
da: Gennemse
de: Durchsuchen
fa: ...جستجو

# C_A_anopFilenameLbl
source: Filename
da: Fil navn
de: Dateiname
fa: نام فایل

# C_A_anopRad
source: A package archive (*.anop) on my computer
da: Et arkiv (*.anop) på min computer
de: Ein Paket-Archiv (*.anop) auf diesem Rechner
fa: یک بسته ارشیو (*.anop) بر روی رایانه من

# C_A_embedRad
source: A package embedded in this installer
da: En pakke indlagt i denne installatør
de: Ein Paket, eingebunden in dieser Installationsroutine
fa: دراین برنامه نصب یک بسته جاسازی شده

# C_A_notFileExists
source: The file "{0}" does not exist
da: Filen "{0}" eksisterer ikke.
de: Die Datei '{0}' existiert nicht
fa: فایل "{0}" وجود ندارد

# C_A_packBrowse
source: Browse...
da: Gennemse...
de: Durchsuchen
fa: ...جستجو

# C_A_packFilenameLbl
source: Filename
da: Filnavn
de: Dateiname
fa: نام فایل

# C_A_packRad
source: A package definition file (package.xml) on my computer
da: En pakke definition fil (package.xml) på min computer
de: Eine Paket-Definitions-Datei (package.xml) auf diesem Rechner
fa: بر روی رایانه من (package.xml) یک بسته تعریف شده فایل

# C_A_selectEmbeddedPackageFirst
source: Select an embedded package before continuing
da: Vælg em indbygget pakke for at forsætte.
de: Wählen Sie eines der eingebundenen Pakete, um fortzufahren.
fa: قبل از ادامه بسته جاسازی شده راانتخاب کنید

# C_A_Subtitle
source: The package to install can either be in this computer's filesystem or embedded in this installer
da: Pakken for at installere kan enden være på denne computer's fil-system eller indlagt i denne installatør
de: Das Paket kann entweder im Dateisystem dieses Rechners vorliegen, oder in dieser Anolis-Distribution eingebunden sein.
fa: بسته را میتوانید نصب کنید بروی رایانه وفایل های سیستمی یا یا جاسازی شده در برنامه نصب

# C_A_Title
source: Select a package to install
da: Vælg en pakke at installere
de: Wähle das zu installierende Paket
fa: انتخاب بسته برای نصب

# C_B_conditionError
source: There was an error whilst attempting to evaluate the package's suitability for your computer. Contact the package's author.
da: Der opstod en fejl under evalueringen af pakken's tilpashed for din computer. Kontakt venligst pakken's ejer.
de: Bei der Überprüfung des Pakets trat ein Fehler auf! Bitte setzen Sie sich mit dem Paket-Autor in Verbindung.
fa: در اینجا در خلال ارزیابی و سازوگاری رایانه شما خطا روی داد لطفا با سازنده بسته ارتباط برقرار کنید

# C_B_error
source: An error occured whilst attempting to extract the package
da: Der skete en fejl under udpakningen af pakken
de: Bei dem Versuch ein Paket zu entpacken trat ein Fehler auf!
fa: وجود یک خطا در مدتی که قصد استخراج بسته را داشتید

# C_B_error_Cus
source: An error occured whilst attempting to extract {0}
da: Der skete en fejl under udpakningen af {0}
de: Bei dem Versuch {0} zu entpacken ist ein Fehler aufgetreten!
fa: {0}وجود یک خطا در مدتی که قصد استخراج بسته را داشتید

# C_B_errorPackageXmlNotFound
source: The specified package archive did not contain a package definition file.
da: Den specificerede pakke indeholdte ikke en pakke definitions fil.
de: Das angegebene Paket-Archiv enthält keine Paket-Definitions-Datei.
fa: در بسته ارشیو معین شده فایلهای تعریف شده وجود ندارد

# C_B_instantiating
source: Instantiating Package
da: Istandsætter pakken
de: Paket laden
fa: مستقیما بسته

# C_B_statusLbl
source: Preparing...
da: Klargører.
de: Wird vorbereitet...
fa: ...در حال

# C_B_Subtitle
source: Please wait whilst the installer prepares the package for installation
da: Vent venligst mens installatøren forbereder pakken for installation
de: Bitte warten, die Installationsroutine bereitet das Paket für die Installation vor
fa: در حال نصب بسته منتظر بمانید برای نصب شدن

# C_B_Subtitle_Cus
source: Please wait whilst the installer prepares {0} for installation
da: Vent venligst mens installatøren forbereder {0} for installation
de: Bitte warten, die Installationsroutine bereitet die Installation von {0} vor
fa: لطفا منتظر بمانید در مدت نصب{0} برای نصب شدن کامل

# C_B_Title
source: Preparing Package
da: Klargører pakken
de: Paket vorbereiten
fa: بسته در حال

# C_B_Title_Cus
source: Preparing {0}
da: Klargører {0}
de: Vorbereiten von {0}
fa: {0}در حال

# C_C_downloadInfo
source: Visit Package Webpage
da: Besøg pakkens hjemmeside.
de: Besuche Paket-Webseite
fa: مشاهده وب پیج بسته

# C_C_downloadInfo_Cus
source: Visit {0} 's Webpage
da: Besøg {0}'s hjemmeside
de: Besuche {0}s Webseite
fa: مشاهده {0} 's وب پیج

# C_C_downloadNo
source: No
da: Nej
de: Nein
fa: خیر

# C_C_downloadProgress
source: {0}% - {1}KB of {2}KB downloaded at {3}KBps
da: {0}% - {1}KB af {2}KB downloadet ved {3}KBps
de: {0}% - {1}kB von {2}kB heruntergeladen ({3}kB/s)
fa: {0}% - {1}KB of {2}KB دانلود بر {3}KBps

# C_C_downloadYes
source: Yes
da: Ja
de: Ja
fa: بله

# C_C_infoChecking
source: Checking for package update
da: Tjekker for pakke opdateringer
de: Überprüfe Verfügbarkeit einer Paket-Aktualisierung
fa: بررسی بسته برای بروزرسانی

# C_C_infoFailed
source: Check for updates failed: could not download update info
da: Kunne ikke tjekke for opdateringer: Kunne ikke downloade opdaterings informationer
de: Überprüfung fehlgeschlagen! Konnte Aktualisierungs-Informationen nicht herunterladen
fa: بررسی برای بروز رسانی ناموفق بود:اطلاعات بروز شده را نمیتوانید دانلود کنید

# C_C_infoUpdateAvailableAutomatic
source: An updated version ({0}) of this package is available. Would you like to download it now?
da: En opdateret version ({0}) af denne pakke er tilgængelig. Vil du downloade den nu?
de: Eine aktuellere Version ({0}) dieses Pakets ist verfügbar. Möchten Sie diese jetzt herunterladen?
fa: یک نسخه بروز({0}) از این بسته وجود دارد اگر دوست دارید دانلود کنید

# C_C_infoUpdateAvailableManual
source: An updated version ({0}) of this package is available, but you need to download it manually. Click Visit Package Webpage for more information.
da: En opdateret version ({0}) af denne pakke er tilgængelig, men du kan kun hente den manuelt. Klik Besøg pakke hjemmeside for mere information
de: Eine aktuellere Version ({0}) dieses Pakets ist verfügbar. Jedoch kann diese nur manuell heruntergeladen werden. Klicken sie auf 'Besuche Paket-Webseite' für eingehende Informationen.
fa: یک نسخه بروز({0}) از این بسته موجود میباشد اما اگر شما احتیاج دارید دانلود کنید به صورت دستی.مشاهده کنید وب سایت رابرای دانلود

# C_C_infoUpdateLatest
source: You have the latest version ({0}) of this package.
da: Du har den seneste version ({0}) af denne pakke
de: Sie haben die aktuellste Version ({0}) dieses Pakets.
fa: شما باید جدید ترین نسخه ({0}) از این بسته

# C_C_sfdTitle
source: Save downloaded package to...
de: Speichere heruntergeladenes Paket unter...
fa: ...ذخیره بسته دانلود شده در

# C_C_skipCheckLbl
source: You can skip the update check by clicking the Next button at any time.
da: Du kan undgå opdaterings tjekket ved at trykke Næste når som helst.
de: Mittels eines Klicks auf 'Weiter' kann die Prüfung auf Aktualisierungen jeder Zeit abgebrochen werden.
fa: بررسی برای بروز رسانی را هر زمانی میتوانید اسکیپ کنید

# C_C_statusLbl
source: Preparing...
da: Klargører..
de: Wird vorbereitet...
fa: ...در حال

# C_C_Subtitle
source: The package may have been updated since you acquired it. Now checking for updates.
da: Denne pakke kan have været opdateret siden du fik den. Checker nu for opdateringer.
de: Das Paket könnte seither aktualisiert worden sein. Jetzt die Verfügbarkeit einer Paket-Aktualisierung prüfen.
fa: برای بروز رسانی حالا بررسی کنید پس از بررسی ان ممکن است بسته بروز شده باشد

# C_C_Title
source: Checking for Package Updates
da: Tjekker for pakke opdateringer
de: Prüfen, ob Aktualisierungen für dieses Paket verfügbar sind
fa: بررسی بسته برای بروز رسانی

# C_D_installerNotes
source: Anolis Installer Readme
da: Anolis installations Læs Mig
de: Anolis Installer Lies-Mich
fa: مطالعه نصب انا الیس

# C_D_packageNotes
source: {0} Package Release Notes
da: {0} Pakke udgivelses notater
de: {0} Veröffentlichungs-Hinweise
fa: {0} تبصره انتشار بسته

# C_D_Subtitle
source: Review any release notes made by the package's author
da: Gennemse alle udgivelses notater lavet af pakken's forfatter
de: Zeige Veröffentlichungs-Hinweise des Paket-Autors
fa: مرور هر یک از یادداشت های نوشته شده توسط مولف بسته

# C_D_Subtitle_Cus
source: Review any release notes made by {0}
da: Gennemse alle udgivelses notater lavet af {0}
de: Zeige Veröffentlichungs-Hinweise von {0}
fa: {0}مرور هر یک از یادداشت های ایجاد شده با

# C_D_Title
source: Package Release Notes
da: Pakke udgivelses notater
de: Paket-Informationen
fa: تبصره انتشار بسته

# C_E_Disabled
source: Disabled
de: Deaktiviert
fa: غیر فعال شده

# C_E_Enabled
source: Enabled
de: Aktiviert
fa: فعال شده

# C_E_Explicit
source: Explicit
de: ausdrücklich
fa: واضح

# C_E_Inherit
source: Inherited
de: durch übergeordnetes Element
fa: منع شده

# C_E_noInfo
source: The selected item '{0}' does not have any information associated with it
da: Det valgte produkt '{0}'
de: Das ausgewählte Element '{0}' besitzt keine Informationen
fa: ایتمهای انتخاب شده در بر ندارد هیچ یک از ا'{0}'طلاعات شریک با ان

# C_E_NullItem
source: Null Item
de: Kein Element
fa: ایتم پوچ

# C_E_simple
source: Simple
de: Einfach
fa: ساده

# C_E_Subtitle
source: You can choose whether or not to install components of this package
da: Du kan vælge om du vil installere komponenter af pakken eller ej
de: Wählen Sie die Komponenten aus, welche installiert werden sollen
fa: در این قسمت شما میتوانید انتخاب کنید چه قسمتی نصب شود یا نه

# C_E_Title
source: Modify Package
da: Rediger pakke
de: Komponenten auswählen
fa: نصب شود یا نه

# C_E_Unnamed
source: Unnamed
de: Unbenannt
fa: بدون نام

# C_E_UnnamedGroup
source: Unnamed Group
de: Unbenannte Gruppe
fa: گروه بدون نام

# C_E1_advanced
source: Advanced
de: Erweitert
fa: پیشرفته

# C_E1_bitmapsLbl
source: Bitmaps
fa: bmpتصاویر

# C_E1_Custom
source: Custom
de: Benutzerdefiniert
fa: سفارشی

# C_E1_logonLbl
source: Welcome Screen
de: Wilkommen-Bildschirm
fa: صفحه خوش امدید

# C_E1_logonPreview
source: Preview
de: Vorschau
fa: پیش نمایش

# C_E1_previewLbl
source: Preview Area
de: Desktop-Vorschau
fa: نقاط پیش نمایش

# C_E1_Subtitle
source: You can customize how your computer will appear after installation
de: Es kann angepasst werden, wie die Windows-Oberfläche nach der Installation erscheinen soll
fa: شما میتوانید رایانه را سفارشی کنید که بعد از نصب چگونه پدیدار شود

# C_E1_Title
source: Select theming options
de: Wähle Design-Optionen
fa: تنظیمات انتخاب تم

# C_E1_visualStylesLbl
source: Visual Style
de: Design (Visual Style)
fa: ویژوال استیل

# C_E1_wallpaperLbl
source: Wallpaper
de: Hintergrundbild
fa: کاغذ دیواری

# C_F_advanced
source: Advanced Options...
de: Erweiterte Optionen...
fa: ...تنظیمات پیشرفته

# C_F_backup
source: Create uninstallation backup directory (Recommended)
da: Lav afinstallerings backup mappe (Anbefalet)
de: Erstelle Sicherungs-Verzeichnis für Deinstallation (empfohlen)
fa: ایجاد انینستال نسخه پشتیبان دایرکوری توصیه میشود

# C_F_backupBrowse
source: Browse...
da: Gennemse...
de: Durchsuchen
fa: ...جستجو

# C_F_backupDesc
source: You must create a backup directory if you ever wish to uninstall this package in future
da: Du skal lave en backup mappe hvis du nogensinde ønsker at afinstallere denne pakke i fremtiden
de: Eine Sicherung muss angelegt werden, wenn die Möglichkeit bestehen soll, dass dieses Paket jemals wieder deinstalliert werden kann.
fa: شما باید ایجاد کنید دایرکتوری نسخه پشتیبان اگر شما استفاده میکنید از ویژگی انینستال

# C_F_comp
source: Install to this Computer
da: Installer på denne computer
de: Installiere auf diesem Rechner
fa: نصب بر روی این رایانه

# C_F_i386
source: Install to a Windows Setup CD (I386)
da: Installer til I386
de: Installiere in ein Windows CD-Image
fa: نصب بر روی سی دی نصب ویندوز

# C_F_i386Browse
source: Browse...
da: Gennemse...
de: Durchsuchen
fa: ...جستجو

# C_F_i386Lbl
source: CD Root
da: CD rod
de: Wurzel der CD:
fa: روت سی دی

# C_F_installButton
source: Install
da: Installer
de: Installieren
fa: نصب

# C_F_pathExistsBackup
source: The specified backup directory already exists and contains files. Backups must be made to either an empty directory or a directory that doesn't exist yet.
da: Den specificerede backup mappe findes allerede og indeholder filer. Backups skal laves til enden en tom mappe eller en mappe der ikke allerede findes.
de: Das angegebene Sicherungs-Verzeichnis ist nicht leer! Sicherungen können nur auf einen leeren oder noch nicht existierenden Ordner angewendet werden.
fa: محل نسخه پشتیان از قبل وجود داشت و دارای فایل بود نسخه پشتیبان در پوشه خالی باید ایجاد شود

# C_F_pathInvalidBackup
source: The specified backup path is not valid
da: Den specificerede backup sti er ikke korrekt
de: Der angegebene Sicherungspfad ist nicht gültig
fa: مسیر معییشده برای نسخه پشتیبان معتبر صحیح نمی باشد

# C_F_pathInvalidI386
source: The specified CD root is not valid
da: Den specificerede I386 sti er ikke korrekt
de: Der angegebene Pfad verweist nicht auf ein gültiges Windows CD-Image!
fa: مسیر معیین شده نصب سی دی معتبر نمیباشد

# C_F_Subtitle
source: Select a backup directory and other options
da: Vælg et backup mappe og andre muligheder
de: Wähle ein Sicherungs-Verzeichnis und andere Optionen
fa: انتخاب دایرکتوری نسخه پشتیبان و دیگر گزینه ها

# C_F_sysRes
source: Create System Restore Point (Recommended)
da: Lav et System gendannelses punkt (Anbefalet)
de: Erstelle System-Wiederherstellungs-Punkt (empfohlen)
fa: ایجاد سیستم ریستور پوینت توصه میشود

# C_F_sysResDesc
source: An added layer of protection. Note this does not always protect against modifications made to non-Windows files under Program Files
da: Et ekstra lag af sikkerhed. Læg mærke til at dette vil ikke altid forhindre imod ændringer lavet til ikke-Windows filer under Programmer
de: Beachte: diese zusätzliche Sicherung schützt unter Umständen nicht vor Modifikationen an Nicht-Windows-Dateien im Ordner 'Programme'
fa: اضافه کردن یک لایه محافظ.یادداشت این همیشه محافظت نمیکند از تغییرات دوباره ایجاد شده بروی ویندوز فایل در پروگرام فایل

# C_F_Title
source: Installation Options
da: Installations muligheder
de: Installations-Einstellungen
fa: گزینه های نصب

# C_F2_liteDesc
source: If 128x128 (and larger) sized icon images are installed on non-English language versions of Windows certain system files may not behave as expected and may cause compatibility problems with some programs. Checking this option prevents 128x128-sized icons from being installed.
de: Wenn Ikons ab einer Größe von 128 x 128 Pixeln auf einer nicht-englischen Windows-Version installiert werden, dann kann es sein, dass sich einige Dateien im Anschluss anders verhalten, was zu Inkompatibilitäts-Problemen mit einigen Programmen führen kann. Die Auswahl dieser Option verhindert die Installation von großen Ikons.
fa: اگر 128x128 (و بزرگتر) اندازه تصاویر ، نماد هستند در عدم نصب نسخه های زبان انگلیسی - فایل های ویندوز سیستم خاصی نمی تواند به عنوان رفتار انتظار می رود و ممکن است مشکل سازگاری با برخی از برنامه ها شود. چک کردن این گزینه مانع 128x128 اندازه آیکون از بودن نصب شده است.

# C_F2_restoreDesc
source: System Restore provides an added layer of protection to the uninstaller. Note this does not always protect against modifications made to non-Windows files under Program Files
de: Die Systemwiederherstellung stellt eine zusätzliche Sicherung dar. Beachte, dass diese unter Umständen nicht vor Veränderungen an Nicht-Windows-Dateien im Ordner 'Programme' schützen kann.
fa: سیستم بازگردانی یک لایه اضافه را فراهم میکند برای حفاظت از حذف کننده.نکته توجه داشته باشید همیشه در برابر تغییرات ساخته شده را به غیر از فایل های ویندوز همیشه فایلهای در پروگرام فایل هستند

# C_F2_RestoreDescNA
source: System Restore is unavailable on your system and cannot be enabled for this installation.
de: Die Systemwiederherstellung ist auf Ihrem System nicht verfügbar und kann daher nicht verwendet werden.
fa: .بازگردانی سیستم در دسترس نیست بر روی سیستم و نمیتواند ان را فعال کند برای این نصب

# C_F2_Title
source: Advanced Installation Options
de: Erweiterte Installations-Optionen
fa: تنظیمات پیشرفته نصب کننده

# C_G_cleanup
source: Post-Install Cleanup
de: Säuberung nach Installation
fa: پست-نصب تمیز کننده

# C_G_status
source: {0}% complete - {1}
da: {0}% færdig - {1}
de: {0}% abgeschlossen - {1}
fa: {0}% کامل - {1}

# C_G_statusLbl
source: Preparing...
da: Forbereder...
de: Vorbereiten...
fa: ...در حال

# C_G_Subtitle
source: Your selected package is being installed
da: Din valge pakke er ved at blive installeret
de: Das ausgewählte Paket wird gerade installiert
fa: شما انتخاب کردید بسته را بر نصب

# C_G_Subtitle_Cus
source: {0} is being installed
da: {0} er ved at blive installeret
de: {0} wird installiert
fa: {0} ان نصب شده است

# C_G_Title
source: Installing Package
da: Installerer pakke
de: Installiere Paket
fa: در حال نصب بسته

# D_A_destBrowse
source: Browse...
da: Gennemse...
de: Durchsuchen
fa: ...جستجو

# D_A_destLbl
source: Destination directory
da: Destination mappe
de: Zielverzeichnis:
fa: مقصد دایرکتوری

# D_A_progGroup
source: Create Anolis program group in the start menu
da: Lav et Anolis program gruppe i start menuen
de: Erstelle Anolis-Verknüpfung im Startmenü
fa: ایجاد انا الیس در گروه نرمافزاری در استارت منو

# D_A_progGroupAll
source: For all users
de: Für alle Benutzer
fa: برای همه کاربرها

# D_A_progGroupMe
source: Just for me
da: Kun for mig
de: Nur für mich
fa: فقط برای من

# D_A_Subtitle
source: Select a directory in which to place the downloaded tools and set other options
da: Vælg en mappe at downloade værktøjer og ændre andre instillinger.
de: Spezifizieren Sie ein Verzeichnis für die zu ladenden Werkzeuge und weitere Optionen
fa: برای قرار دادن ابزار دانلود شده و تنظیم دیگر گزینه ها یک دایرکتوری انتخاب کنید

# D_A_Title
source: Destination Directory and Installation Options
da: Destinations mappe og installations instillinger.
de: Zielverzeichnis und Installations-Optionen
fa: مقصد دایرکتوری و گزینه های نصب
